[{
    "jobid": "SA",
    "location": "Fremont, CA",
    "Title": "Software Developer (multiple openings)",
    "description": "<div class='job_description'> <p><strong>Job Title:</strong>Systems Analyst (multiple openings)</p> <p><strong>Job Duties:</strong>Define and analyze computer systems. Specific duties include</p> <ul style='padding-left:17px;'> <li>Install, configure and administer Weblogic 12c/11g, JBoss EAP 5/6/7, Apache 2.2/2.4 in different environments like Development, Stage, ITF, MTF and Production on Linux, Solaris and AIX operating system.</li> <li>Create graphs for different metrics like CPU, Memory, Disk Usage, Swap space, for trending historical data.</li> <li>Perform stop/start Jboss 7.0/6.0 centrally from console by taking advantage of the domain controller.</li> <li>Automate WAR deployment procedure in production environment running on Weblogic and JBoss using UNIX shell script. Provid development team with thread dumps and heap dumps using Jstack and Jhat, JDK tools.</li> <li>Create Virtual Servers, SSL Profiles, Persistence profiles, Pools, Monitors, iRules, ASM Relaxations, DR scripts on BIG IP F5 and Netscalar LoadBalancers.</li> <li>Provide documentation of all the environments that were built during the project. Create integration background including XML/XSLT, Data Transformation, Message Routing, Integration Infrastructure and Web Services (WS*, REST). Resolved production issues within the SLA. Work with Apache Tomcat, Weblogic, SOA, Fusion, Python and Web Services.</li> </ul> <p></p> <p><strong>JOB QUALIFICATIONS:</strong></p> <ul style='padding-left:17px;'> <li>Bachelor’s degree in Computer Science, Engineering or other related fields plus 2 years of experience </li> <li>Foreign degree equivalent is acceptable. Experience to include working with Apache Tomcat, Weblogic, SOA, Fusion, Python and Web Services.</li> </ul> <p></p> <p><strong>HOURS:</strong>40 hours per week; M-F, 9:00 a.m. – 6:00 p.m. </p> <p><strong>JOB LOCATION:</strong>43745 Nansa Court, Fremont, CA 94539. Travel is not required but candidates must be willing to relocate to unanticipated cities across the country per contract demand.</p> <p><strong>CONTACT PERSON:</strong>E-mail resume referencing job code# 317SA to WorldScape Inc. at Jobs@worldscapeinc.com</p> <p><strong>Note:</strong>This position is eligible for the company’s referral incentive program. Please refer to the posted policy for details.</p> </div>"
}, {
    "jobid": "SD",
    "location": "Fremont, CA",
    "Title": "Systems Analyst (multiple openings)",
    "description": "<div class='job_description'> <p><strong>Job Title:</strong>Software Developer (multiple openings)</p> <p><strong>Job Duties:</strong>Specific duties Include</p> <ul style='padding-left:17px;'> <li>Analyzes, documents, codes, tests, maintains, and documents complex Java-language routines to accommodate the needs of user departments.</li> <li>Works with Developers, Analysts and business users to ensure application systems change as necessary to meet business requirements and to ensure programs meet technical requirements for performance and results.</li> <li>Candidates must have the ability to perform the essential functions of the position with or without a reasonable accommodation. Design complex object-oriented solutions based on advanced software development practices and methodologies.</li> <li>Design and perform unit testing plans and project implementation in an open source environment.</li> </ul> <p></p> <p><strong>JOB QUALIFICATIONS:</strong></p> <ul style='padding-left:17px;'> <li>Bachelor’s degree in Computer Science, Engineering or a related field plus 2 years of experience. Foreign degree equivalent based on education, training, and/or experience is acceptable.</li> <li>Excellent mathematical, analytical and problem-solving skills plus.</li> <li> General Programming Skills, Analyzing Information, Problem Solving, Software AlgorithmDesign, Software Performance Tuning, Attention to Detail, Software Design, SoftwareDebugging, Software Development Fundamentals, Software Documentation, SoftwareTesting. </li> <li>Experience with JSP/CSS/JavaScript/AJAZ/HTML5.</li> </ul> <p></p> <p><strong>HOURS:</strong>40 hours per week; M-F, 9:00 a.m. – 6:00 p.m. </p> <p><strong>CONTACT PERSON:</strong>E-mail resume referencing job code# 317SA to WorldScape Inc. at Jobs@worldscapeinc.com</p> <p><strong>Note:</strong>This position is eligible for the company’s referral incentive program. Please refer to the posted policy for details.</p></div>"
}, {
    "jobid": "SE",
    "location": "Fremont, CA",
    "Title": "Systems Analyst (multiple openings)",
    "description": "<div class='job_description'> <p><strong>Job Title:</strong>Software Engineer (multiple openings)</p> <p><strong>Job Duties:</strong>Specific duties Include</p> <ul style='padding-left:17px;'> <li>Assist in analyzing users’ need, then design, test, and develop software to meetthose need. Recommend software upgrades for customers’ existing programs and systems.Assist in designing each piece of the application or system and plan how the pieces will worktogether.</li> <li>Assist in creating a variety of models and diagrams (such as flowcharts) thatinstruct programmers how to write the software code.</li> <li>Assist in ensuring that the softwarecontinues to function normally through software maintenance and testing. Assist indocumenting every aspect of the application or system as a reference for future maintenanceand upgrades.</li> <li>Assist in collaborating with other computer specialists to create optimumsoftware.</li> <li>Develop systems in a variety of computer languages, such as C++ and Java.</li> </ul> <p></p> <p><strong>JOB QUALIFICATIONS:</strong></p> <ul style='padding-left:17px;'> <li>Bachelor’s degree in Computer Science, Engineering or a related field plus 2 years ofexperience. Foreign degree equivalent based on education, training, and/or experience isacceptable.</li> <li> Excellent logic and analysis skills are a plus. </li> <li>General Programming Skills, Analyzing Information, Problem Solving, SoftwareAlgorithm Design, Software Performance Tuning, Attention to Detail, Software Design,Software Debugging, Software Development Fundamentals, Software Documentation,Software Testing.</li> </ul> <p></p> <p><strong>HOURS:</strong>40 hours per week; M-F, 9:00 a.m. – 6:00 p.m. </p> <p><strong>CONTACT PERSON:</strong>E-mail resume referencing job code# 317SA to WorldScape Inc. at Jobs@worldscapeinc.com</p> <p><strong>Note:</strong>This position is eligible for the company’s referral incentive program. Please refer to the posted policy for details.</p></div>"
}, {
    "jobid": "CP",
    "location": "Fremont, CA",
    "Title": "Computer Programmer (multiple openings)",
    "description": "<div class='job_description'> <p><strong>Job Title:</strong>Computer Programmer (multiple openings)</p> <p><strong>Job Duties:</strong>Specific duties Include</p> <ul style='padding-left:17px;'> <li>Gather/study specifications given by software developers: analyze userneeds/business requirements; design software solutions; develop/revise computer programs;design computer programs/applications to process data.</li> <li>Create reusable components andcontent externalization for multi-language applications. Work with product owners;coordinate with design and marketing teams to ensure a positive user experience interfaceand UAT processes.</li> <li>Do systems analyst and programming tasks; maintain and control use ofcomputer systems software; code UI fame works using jQuery, Java, HTML5, CSS3,angular.js for front-end functionality, payment validation and visual effects, etc. develop/write computer programs, website development.</li> <li>Gather sales initiatives and point of salerequirements from sales teams. Gather requirements for product marketing initiatives frommarketing teams.</li> </ul> <p></p> <p><strong>JOB QUALIFICATIONS:</strong></p> <ul style='padding-left:17px;'> <li>Bachelor’s degree in Computer Science, Engineering or a related field plus 2 years ofexperience. Foreign degree equivalent based on education, training, and/or experience isacceptable.</li> <li> Knowledge in client side web technologies, this includes but does not limit to RESTful APIJavaScript, AJAX, Hibernate etc. </li> <li>Excellent logic and analysis skills are a plus.</li> </ul> <p></p> <p><strong>HOURS:</strong>40 hours per week; M-F, 9:00 a.m. – 6:00 p.m. </p> <p><strong>CONTACT PERSON:</strong>E-mail resume referencing job code# 317SA to WorldScape Inc. at Jobs@worldscapeinc.com</p> <p><strong>Note:</strong>This position is eligible for the company’s referral incentive program. Please refer to the posted policy for details.</p></div>"
}]